// language indexes: EN=0, UA=1, BY=2, RU=3;

export const languages = {
  signIn: ['Sign in ', 'Увійти ', 'Увайсці ', 'Войти '],
  register: ['Register ', 'Реєстрація ', 'Рэгiстрацыя ', 'Регистрация '],
  returnWelcomePage: [
    ' To Welcome Page',
    ' На стартову сторінку',
    ' На стартавую старонку',
    ' На стартовую страницу',
  ],
  returnBoardsPage: [' Return to Boards', ' Назад до дошок', ' Назад да дошак', ' Назад досок'],
  startPage: ['Start page', 'На стартову', 'На стартавую', 'На стартовую'],
  createBoard: ['New board', 'Нова дошка', 'Новая дошка', 'Новая доска'],
  editProfile: ['Edit profile', 'Редаг. профіль', 'Рэдаг. профіль', 'Редакт. профиль'],
  signOut: ['Sign out ', 'Вийти ', 'Выйсці ', 'Выйти '],
  toBoards: ['Boards ', 'Дошки ', 'Дошкi ', 'Доски '],
  welcome: [
    'Welcome to our task manager',
    'Вітаємо у нашому таск-менеджері',
    'Вiтаем у нашым таск-менеджэры',
    'Добро пожаловать в наш таск-менеджер',
  ],
  about: ['About the team:', 'Про команду:', 'Аб камандзе:', 'О команде:'],
  Max: ['Maksym Dudniev', '', 'Максiм Дуднеў', 'Максим Дуднев'],
  Den1: ['Dzianis Matsveyeu', 'Денис ', 'Дзянiс Мацвееў', 'Денис Матвеев'],
  Den2: ['Dzianis Valkovich', 'Денис Валковiч', 'Дзянiс Валковiч', 'Денис Волкович'],
  MaxPart: [
    `Participation in the project:\n
    - Login/Register\n
    - Edit profile/Delete user\n
    - Board route (drag-n-drop)\n
    - Styling and decoration\n
    - Deploy backend\n`,
    `Участь у проекті: \n
    - Вхід/Реєстрація\n
    - Редакт. профілю/Видалення\n
    - Борд роут (драг-н-дроп)\n
    - Стилізація та оформлення\n
    - Деплой бекенда\n`,
    `Удзел у праекце: \n
    - Уваход/Рэгістрацыя\n
    - Рэдакт. профілю/Выдаленне\n
    - Борд роўт (драг-н-дроп)\n
    - Стылізацыя і афармленне\n
    - Дэплой бэкэнда\n`,
    `Участие в проекте: \n
    - Вход/Регистрация\n
    - Редакт. профиля/Удаление\n
    - Борд роут (драг-н-дроп)\n
    - Стилизация и оформление\n
    - Деплой бэкенда\n
    `,
  ],
  Den1Part: [
    `Participation in the project:\n
    - Main route\n
    - Board route\n
    - Extra functionality\n
    - Loading animation\n
    - Localization\n`,
    `Участь у проекті: \n
    - Головний роут\n
    - Борд роут\n
    - Додатковий функціонал\n
    - Анімація завантажень\n
    - Локалізація\n`,
    `Удзел у праекце: \n
    - Галоўны роўт\n
    - Борд роўт\n
    - Дадатковы функцыянал\n
    - Анімацыя загрузак\n
    - Лакалізацыя\n`,
    `Участие в проекте: \n
    - Главный роут\n
    - Борд роут\n
    - Дополнительный функционал\n
    - Анимация загрузок\n
    - Локализация\n
    `,
  ],
  Den2Part: [
    `Participation in the project:\n
    - Welcome Page\n
    - Header and Footer\n
    - Private routes\n
    - Localization\n
    - Styling and decoration`,
    `Участь у проекті: \n
    - Вітальна сторінка\n
    - Хедер i Футер\n
    - Локалізація\n
    - Стилізація та оформлення\n
    - Приватні роути\n`,
    `Удзел у праекце: \n
    - Вітальная старонка\n
    - Хэдэр i Футэр\n
    - Прыватныя роўты\n
    - Лакалізацыя\n
    - Стылізацыя i афармленне\n`,
    `Участие в проекте: \n
    - Приветственная страница\n
    - Хедер и Футер\n
    - Приватные роуты\n
    - Локализация\n
    - Стилизация и оформление\n
    `,
  ],
  aboutApp: ['About the App:', 'Про додаток:', 'Аб дадатку:', 'О приложении:'],
  appDescryption: [
    ` In this application, you can plan your tasks, thereby finding time for your favorite things and hobbies, such as writing code🤣.
    But seriously, here you can create a personal account and come up with boards with tasks to achieve goals or just out of curiosity. The task manager will communicate with you through dialog boxes and make warning sounds so that it is clear what is happening here.
    If you suddenly get bored with the interface, you can always change it and get new sensations from a new color theme, from as many as three!
     We tried very hard, sometimes lacked sleep while writing this application, but we did it with love and kindness. Perhaps you will like our task manager and you will use it on your mobile or computer, we will only be happy about it!`,
    `У цьому додатку можна планувати свої завдання, тим самим знаходити час для улюблених справ та хобі, наприклад, писати код🤣.
    А якщо серйозно, то тут можна створити особистий кабінет та вигадувати дошки із завданнями для досягнення цілей чи просто з цікавості. Менеджер завдань спілкуватиметься з Вами шляхом діалогових вікон і видаватиме попереджувальні звуки, щоб було зрозуміло, що тут відбувається.
    Якщо раптом інтерфейс набридне, його завжди можна поміняти і отримати нові відчуття від нової теми кольору, від цілих трьох!
    Ми дуже старалися, іноді недосипали під час написання цієї програми, але робили її з любов'ю та добротою. Можливо Вам сподобається наш менеджер завдань і Ви користуватиметеся ним у мобільному чи комп'ютері, ми будемо цьому тільки раді!`,
    `У гэтым дадатку можна планаваць свае задачы, тым самым знаходзіць час для любімых спраў і хобі, напрыклад пісаць код 🤣.
    А калі сур'ёзна, то тут можна стварыць асабісты кабінет і прыдумляць дошкі з задачамі для дасягнення мэт ці проста з цікаўнасці. Мэнэджар задач будзе мець зносіны з Вамі шляхам дыялогавых вокнаў і выдаваць папераджальныя гукі, каб было зразумела, што тут адбываецца.
    Калі раптам інтэрфейс надакучыць, яго заўсёды можна змянiць і атрымаць новыя адчуванні ад новай каляровай тэмы, ад цэлых трох!
    Мы вельмі стараліся, часам недасыпалі падчас напісання гэтай праграмы, але рабілі яго з любоўю і дабрынёй. Магчыма Вам спадабаецца наш мэнэджар задач і Вы будзеце карыстацца ім у мабільным ці кампутары, мы будзем гэтаму толькі рады!`,
    `В этом приложении можно планировать свои задачи, тем самым находить время для любимых дел и хобби, например писать код🤣. 
    А если серьезно, то здесь можно создать личный кабинет и придумывать доски с задачами для достижения целей или просто из любопытства. Менеджер задач будет общаться с Вами путем диалоговых окон и издавать предупредительные звуки, чтобы было понятно, что тут происходит.
    Если вдруг интерфейс надоест, его всегда можно поменять и получить новые ощущения от новой цветовой темы, от целых трех!
    Мы очень старались, иногда недосыпали во время написания этого приложения, но делали его с любовью и добротой. Возможно Вам понравится наш менеджер задач и Вы будете пользоваться им в мобильном или компьютере, мы будем этому только рады!`,
  ],
  haveReg: ['Already have an account?', 'Вже є акаунт?', 'Ужо ёсць акаўнт?', 'Уже есть аккаунт?'],
  notHaveReg: [
    'Don`t have an account yet?',
    'Ще немає акаунту?',
    'Яшчэ няма акаўнта?',
    'Ещё нет аккаунта?',
  ],
  registration: ['Registration', 'Реєстрація', 'Рэгістрацыя', 'Регистрация'],
  authorization: ['Authorization', 'Авторизація', 'Аўтарызацыя', 'Авторизация'],
  name: ['Name', 'Ім`я', 'Iмя', 'Имя'],
  login: ['Login', 'Логін', 'Логiн', 'Логин'],
  password: ['Password', 'Пароль', 'Пароль', 'Пароль'],
  newName: ['New name', 'Нове iм`я', 'Новае iмя', 'Новое имя'],
  newPassword: ['New password', 'Новий пароль', 'Новы пароль', 'Новый пароль'],
  submit: ['Submit', 'Підтвердити', 'Пацвердзіць', 'Подтвердить'],
  deleteUser: ['Delete', 'Вилучити', 'Выдалiць', 'Удалить'],
  attention: [
    'Attention! Deleting a user.',
    'Увага! Видалення користувача.',
    'Увага! Выдаленне карыстальніка.',
    'Внимание! Удаление пользователя.',
  ],
  formWarnMin: [
    '*only letters and numbers & min 3 chars',
    '*тільки літери та цифри & мін. 3 символи',
    '*толькі літары i лічбы & мін. 3 сімвала',
    '*только буквы и цифры & мин. 3 символа',
  ],
  formWarnMax: [
    '*only letters and numbers & max 20 chars',
    '*тільки літери та цифри & до 20 символів',
    '*толькі літары i лічбы & да 20 сімвалаў',
    '*только буквы и цифры & до 20 символов',
  ],
  requiredFieldNote: [
    '*this is required field',
    '*це обов`язкове поле',
    '*гэта абавязковае поле',
    '*это обязательное поле',
  ],
  userExist: [
    'User login already exist!',
    'Користувач із таким логіном вже існує!',
    'Карыстальнік з такім лагінам ужо існуе!',
    'Пользователь с таким логином уже существует!',
  ],
  userNotExist: [
    'User was not founded!',
    'Користувач не знайдений!',
    'Карыстальнік не знойдзены!',
    'Пользователь не найден!',
  ],
  successRegister: [
    'You have successfully registered!',
    'Ви успішно зареєстровані!',
    'Вы паспяхова зарэгістраваны!',
    'Вы успешно зарегистрированы!',
  ],
  notFoundPage: [
    'Page not found...',
    'Сторінку не знайдено...',
    'Старонка не знойдзена...',
    'Страница не найдена...',
  ],
  compaireColumn: [
    '*this name is reserved!',
    '*ця назва зарезервована!',
    '*гэта назва зарэзервавана!',
    '*это название зарезервировано!',
  ],
  Boards: ['Boards', 'Дошки', 'Дошкi', 'Доски'],
  boardsPageNoBoardsMessage: [
    "You don't have any boards!",
    'У вас немає жодної дошки!',
    'У вас няма ніводнай дошкі!',
    'У вас нет ни одной доски!',
  ],
  columnInputToolTip: [
    'Сannot be empty!',
    'Не може бути порожнім!',
    'Не можа быць пустым!',
    'Не может быть пустым!',
  ],
  errorBoards: [
    'Something went wrong! Try reloading the page.',
    'Щось пішло не так! Спробуйте перезавантажити сторінку.',
    'Нешта пайшло не так! Паспрабуйце перазагрузіць старонку.',
    'Что-то пошло не так! Попробуйте перезагрузить страницу.',
  ],
};
